#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.avd will be created
  + resource "azurerm_resource_group" "avd" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-avd-dev"
      + tags     = {
          + "environment" = "dev"
          + "managedBy"   = "Terraform"
          + "project"     = "AVD-Capstone"
        }
    }

  # random_string.storage_suffix will be created
  + resource "random_string" "storage_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 1
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.networking.azurerm_nat_gateway.nat_gateway will be created
  + resource "azurerm_nat_gateway" "nat_gateway" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "eastus"
      + name                    = "avd-poc-nat-gateway"
      + resource_group_name     = "rg-avd-dev"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }
    }

  # module.networking.azurerm_nat_gateway_public_ip_association.nat_gateway_public_ip_association will be created
  + resource "azurerm_nat_gateway_public_ip_association" "nat_gateway_public_ip_association" {
      + id                   = (known after apply)
      + nat_gateway_id       = (known after apply)
      + public_ip_address_id = (known after apply)
    }

  # module.networking.azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "avd-poc-vnet-nsg"
      + resource_group_name = "rg-avd-dev"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }
    }

  # module.networking.azurerm_private_dns_zone.private_dns_zone will be created
  + resource "azurerm_private_dns_zone" "private_dns_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.file.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-avd-dev"
      + tags                                                  = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }

      + soa_record (known after apply)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_storage_link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_zone_storage_link" {
      + id                    = (known after apply)
      + name                  = "avd-poc-vnet-dns-link"
      + private_dns_zone_name = "privatelink.file.core.windows.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "rg-avd-dev"
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_public_ip.nat_gateway_public_ip will be created
  + resource "azurerm_public_ip" "nat_gateway_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "avd-poc-nat-gateway-pip"
      + resource_group_name     = "rg-avd-dev"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }
    }

  # module.networking.azurerm_subnet.subnet["avd-hosts"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "avd-poc-avd-hosts-snet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-avd-dev"
      + virtual_network_name                          = "avd-poc-vnet"
    }

  # module.networking.azurerm_subnet.subnet["storage"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "avd-poc-storage-snet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-avd-dev"
      + virtual_network_name                          = "avd-poc-vnet"
    }

  # module.networking.azurerm_subnet_nat_gateway_association.subnet_nat_gateway_association["avd-hosts"] will be created
  + resource "azurerm_subnet_nat_gateway_association" "subnet_nat_gateway_association" {
      + id             = (known after apply)
      + nat_gateway_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.azurerm_subnet_network_security_group_association.subnet_nsg_association["avd-hosts"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.networking.azurerm_subnet_network_security_group_association.subnet_nsg_association["storage"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.networking.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "avd-poc-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-avd-dev"
      + subnet                         = (known after apply)
      + tags                           = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }
    }

  # module.storage.azurerm_private_endpoint.avd_storage will be created
  + resource "azurerm_private_endpoint" "avd_storage" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "avdpocstoragepe"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "rg-avd-dev"
      + subnet_id                = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "avdpocstoragepe-dnszonegroup"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "avdpocstoragepsc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "file",
            ]
        }
    }

  # module.storage.azurerm_storage_account.avd will be created
  + resource "azurerm_storage_account" "avd" {
      + access_tier                        = "Hot"
      + account_kind                       = "FileStorage"
      + account_replication_type           = "LRS"
      + account_tier                       = "Premium"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-avd-dev"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.storage.azurerm_storage_share.avd will be created
  + resource "azurerm_storage_share" "avd" {
      + access_tier         = (known after apply)
      + enabled_protocol    = "SMB"
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + name                = "avdpocshare"
      + quota               = 5120
      + resource_manager_id = (known after apply)
      + storage_account_id  = (known after apply)
      + url                 = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @vanoeski, Action: `pull_request`*